import facebook from "./assets/facebook.svg";
import telegram from "./assets/telegram.svg";
import instagram from "./assets/instagram.svg";
import citizen from "./assets/citizen.png";
import player from "./assets/testRoleImg.jpg";

export const paths = {
  HOME: "/",
  RULES: "/rules",
  EVENTS: "/events",
  PLAYERS: "/players",
  GAME: "/game",
};

export const navLinks = [
  { title: "Події", href: "/events" },
  { title: "Правила та ролі", href: "/rules" },
  { title: "Гравці", href: "/players" },
];

export const iconLinks = [
  { href: "https://facebook.com", src: facebook },
  { href: "https://telegram", src: telegram },
  { href: "https://instagram.com", src: instagram },
];

export const rules = [
  {
    title: "Початок гри",
    subtitle: "У грі бере участь від 7 до 12 гравців.",
    description: [
      "У грі бере участь від 7 до 12 гравців.",
      "Ведучий роздає карти з ролями (мафія, мирні, шериф, дон, лікар, маніяк, путана тощо).",
      "На початку проходить Нульова ніч (Мафія знайомиться одне з одним, Дон знайомиться з мафією, Гравці перевіряють, чи знають свою роль.)",
    ],
    img: "🎬",
  },
  {
    title: "Денна фаза",
    subtitle: "Починається зі слів ведучого: «День настав. Місто прокидається»",
    description: [
      "У грі бере участь від 7 до 12 гравців.",
      "Ведучий роздає карти з ролями (мафія, мирні, шериф, дон, лікар, маніяк, путана тощо).",
      "На початку проходить Нульова ніч (Мафія знайомиться одне з одним, Дон знайомиться з мафією, Гравці перевіряють, чи знають свою роль.)",
    ],
    img: "🌞",
  },
  {
    title: "Голосування",
    subtitle: "Кожен гравець повинен проголосувати — відмова = фол",
    description: [
      "У грі бере участь від 7 до 12 гравців.",
      "Ведучий роздає карти з ролями (мафія, мирні, шериф, дон, лікар, маніяк, путана тощо).",
      "На початку проходить Нульова ніч (Мафія знайомиться одне з одним, Дон знайомиться з мафією, Гравці перевіряють, чи знають свою роль.)",
    ],
    img: "🗳️",
  },
  {
    title: "Нічна фаза",
    subtitle: "Усі закривають очі. Ведучий викликає ролі",
    description: [
      "У грі бере участь від 7 до 12 гравців.",
      "Ведучий роздає карти з ролями (мафія, мирні, шериф, дон, лікар, маніяк, путана тощо).",
      "На початку проходить Нульова ніч (Мафія знайомиться одне з одним, Дон знайомиться з мафією, Гравці перевіряють, чи знають свою роль.)",
    ],
    img: "🌙",
  },
  {
    title: "Перемога фаза",
    subtitle: "Усі закривають очі. Ведучий викликає ролі",
    description: [
      "У грі бере участь від 7 до 12 гравців.",
      "Ведучий роздає карти з ролями (мафія, мирні, шериф, дон, лікар, маніяк, путана тощо).",
      "На початку проходить Нульова ніч (Мафія знайомиться одне з одним, Дон знайомиться з мафією, Гравці перевіряють, чи знають свою роль.)",
    ],
    img: "🏆",
  },
  {
    title: "Бали",
    subtitle:
      "Щоб гра була більш змагальною, ми підраховуємо індивідуальні бали",
    description: [
      "У грі бере участь від 7 до 12 гравців.",
      "Ведучий роздає карти з ролями (мафія, мирні, шериф, дон, лікар, маніяк, путана тощо).",
      "На початку проходить Нульова ніч (Мафія знайомиться одне з одним, Дон знайомиться з мафією, Гравці перевіряють, чи знають свою роль.)",
    ],
    img: "📊",
  },
];

export const pageTitles = [
  {
    path: paths.EVENTS,
    title: "Події",
    subtitle: "Тут ви знайдете всі заплановані ігри та зустрічі клубу",
  },
  {
    path: paths.PLAYERS,
    title: "Гравці",
    subtitle: "Знайомтеся з гравцями та учасниками нашого клубу",
  },
  {
    path: paths.RULES,
    title: "Ролі",
    subtitle: "Кожна роль має унікальні можливості та впливає на перебіг гри",
  },
  {
    path: "custom",
    title: "Як грати у Mafia Mate Club",
    subtitle:
      "Гра складається з двох основних фаз — дня та ночі. Кожен гравець отримує роль і мету, які визначають його стратегію",
  },
];

export const testRole = {
  title: "Мешканець",
  description:
    "Прокидається лише у фазу дня, не має нічних дій. Активно шукає мафію та будує червону команду.",
  img: citizen,
};

export const testPlayer = {
  nickName: "Леді Інтрига",
  name: "Марія Клин",
  img: player,
};
