[
  {
    "title": "Ніч великих інтриг",
    "description": "Спеціальна тематична гра з посиленими ролями та новими сценаріями. Підходить для гравців рівня вище середнього. Призи для найкращого гравця за чорну та червону команди.",
    "date": "2025-09-05",
    "type": "experimental"
  },
  {
    "title": "Турнір новачків",
    "description": "Ідеальна можливість для нових гравців спробувати свої сили у турнірному форматі! Буде один стіл, де кожен учасник зіграє 7 ігор. Навчання та дружня атмосфера гарантовані.",
    "date": "2025-09-12",
    "type": "tournament"
  },
  {
    "title": "Сліпа мафія",
    "description": "Гра в атмосфері таємничості — під час фази дня гравці не знімають маски. Чудово розвиває навички позиційної гри та побудови промов. Підходить для гравців будь-якого рівня",
    "date": "2025-09-19",
    "type": "experimental"
  },
  {
    "title": "Ніч без правил",
    "description": "Експериментальна гра з нестандартними ролями та несподіваними поворотами сюжету. Грати будуть аж 3 команди: червона, чорна та сіра. Ідеально для досвідчених гравців.",
    "date": "2025-09-26",
    "type": "experimental"
  },
  {
    "title": "Мафіозний марафон",
    "description": "Цілих 10 ігор поспіль, щоб перевірити свою витривалість та тактичне мислення. Підійде лише найвитривалішим гравцям :) Переможці отримують клубні бонуси та класні фото від професійного фотографа.",
    "date": "2025-10-03",
    "type": "tournament"
  },
  {
    "title": "День Народження Mate Mafia Club",
    "description": "Найочікуваніша святкова вечірка на честь першого Дня Народження нашого клубу! Ми приготували для Вас багато сюрпризів, тож мерщій реєструйтеся! Точно будуть призи за найкращий дресс-код, тож приходьте у своєму найкращому вбранні.",
    "date": "2025-10-10",
    "type": "party"
  },
  {
    "title": "Фінал сезону",
    "description": "Велика фінальна гра сезону з визначенням найкращого гравця літнього сезону. Після гри - пригощаємо всіх тортиком та робимо тематичну фотосессію",
    "date": "2025-10-17",
    "type": "tournament"
  }
]
