import Facebook from "../assets/facebook.svg?react";
import Telegram from "../assets/telegram.svg?react";
import Instagram from "../assets/instagram.svg?react";

export const paths = {
  HOME: "/",
  RULES: "/rules",
  EVENTS: "/events",
  PLAYERS: "/players",
  GAME: "/game",
  CARDS: "/cards",
  CARDS_RANDOM: "/cards/random/",
};

export const navLinks = [
  { title: "Події", href: "/events" },
  { title: "Правила та ролі", href: "/rules" },
  { title: "Гравці", href: "/players" },
];

export const iconLinks = [
  { href: "https://facebook.com", Icon: Facebook },
  { href: "https://telegram", Icon: Telegram },
  { href: "https://instagram.com", Icon: Instagram },
];

export const rules = [
  {
    title: "Початок гри",
    subtitle: "У грі бере участь від 7 до 12 гравців.",
    description: [
      "У грі бере участь від 7 до 12 гравців.",
      "Ведучий роздає карти з ролями (мафія, мирні, шериф, дон, лікар, маніяк, путана тощо).",
      "На початку проходить Нульова ніч (Мафія знайомиться одне з одним, Дон знайомиться з мафією, Гравці перевіряють, чи знають свою роль.)",
    ],
    img: "🎬",
  },
  {
    title: "Денна фаза",
    subtitle: "Починається зі слів ведучого: «День настав. Місто прокидається»",
    description: [
      "Ведучий оголошує жертв ночі в порядку зростання ігрових номерів.",
      "Після оголошення жертв гравці говорять прощальні промови (40 секунд).",
      "Денне обговорення: 90 секунд.",
      "Кожен гравець говорить індивідуальну промову: 40 секунд кожна.",
    ],
    img: "🌞",
  },
  {
    title: "Голосування",
    subtitle: "Кожен гравець повинен проголосувати — відмова = фол",
    description: [
      "На голосування відводиться 10 секунд.",
      "Кожен гравець обов’язково голосує. Відмова – 1 фол і повторний запуск відліку.",
      "Якщо один гравець набирає більшість голосів, його вилучають з гри і починається його прощальна промова.",
      "У випадку рівної кількості голосів проводиться переголосування.Якщо і після цього кількість голосів рівна, починається ніч без видалення гравців.",
    ],
    img: "🗳️",
  },
  {
    title: "Нічна фаза",
    subtitle: "Усі закривають очі. Ведучий викликає ролі",
    description: [
      "Прокидається команда чорних та обирає жертву (40 секунд). Рішення приймається Доном Мафії або мафією з меншим номером (якщо вся Мафія покинула гру, постріл робить Повія).",
      "Прокидається Повія і на жестах погоджує номер гравця для блокування (20 секунд). Має право відмовитись від дії.",
      "По черзі прокидаються Лікар, Маніяк і Шериф (20 секунд кожен).",
      "Останнім прокидається Дон Мафії і шукає шерифа, показуючи номер гравця.",
    ],
    img: "🌙",
  },
  {
    title: "Результати гри",
    subtitle: "Ведучий оголошує команду-переможця",
    description: [
      "Перемога Чорних (Мафії): кількість Червоних і Чорних рівна, і за столом немає маніяка або він відомий всьому місту.",
      "Перемога Червоних (Міста): жодної мафії за столом.",
      "Нічия: 1 мафія або Дон Мафії або Повія, яка двічі перед цим блокувала Маніяка, та Маніяк залишилися за столом.",
    ],
    img: "🏆",
  },
  {
    title: "Бали",
    subtitle:
      "Щоб гра була більш змагальною, ми підраховуємо індивідуальні бали",
    description: [
      "Максимальна сума індивідуальних балів: +1,5 бали.",
      "Мінімальна сума індивідуальних балів: -1,5 бали.",
      "Гравці отримують додаткові бали виключно за власну гру.",
      "За всі ігри з 16-тої гравець отримує додатково 0,1 бал компенсації на дистанції",
    ],
    img: "📊",
  },
];

export const pageTitles = [
  {
    path: paths.EVENTS,
    title: "Події",
    subtitle: "Тут ви знайдете всі заплановані ігри та зустрічі клубу",
  },
  {
    path: paths.PLAYERS,
    title: "Гравці",
    subtitle: "Знайомтеся з гравцями та учасниками нашого клубу",
  },
  {
    path: paths.RULES,
    title: "Ролі",
    subtitle: "Кожна роль має унікальні можливості та впливає на перебіг гри",
  },
  {
    path: "custom",
    title: "Як грати у Mafia Mate Club",
    subtitle:
      "Гра складається з двох основних фаз — дня та ночі. Кожен гравець отримує роль і мету, які визначають його стратегію",
  },
];

export const eventsSortFields = [
  {
    label: "За датою",
    options: [
      { label: "Спочатку нові", value: "new" },
      { label: "Спочатку старі", value: "old" },
    ],
  },
];

export const playersSortFields = [
  {
    label: "За імʼям",
    options: [
      { label: "А-Я", value: "ascName" },
      { label: "Я-А", value: "descName" },
    ],
  },
  {
    label: "За нікнеймом",
    options: [
      { label: "А-Я", value: "ascNick" },
      { label: "Я-А", value: "descNick" },
    ],
  },
];

export const eventsFilterFields = [
  {
    label: "Тип події",
    options: [
      { label: "Вечірка", value: "party" },
      { label: "Експеримент", value: "experimental" },
      { label: "Змагання", value: "tournament" },
    ],
  },
  {
    label: "Дата",
    options: [
      { label: "Сьогодні", value: "day" },
      { label: "Цього тижня", value: "week" },
      { label: "Цього місяця", value: "month" },
    ],
  },
];
